// MovieModel: Глобальная модель фильмов.
// Основной класс содержит поверхность данных
// Для получение подробностей используется Results
export type MovieModel = {
	// Флаг, указывающий, является ли фильм для взрослых.
	// Значение true означает, что фильм для взрослых, а false - что фильм не для взрослых.
	// Этот флаг используется для фильтрации результатов и предоставления родительского контроля.
	adult: boolean;
	// Путь к изображению заднего плана фильма.
	// Это свойство содержит относительный путь к изображению заднего плана фильма.
	// Путь можно использовать для загрузки изображения с сервера, на котором хранятся данные о фильмах.
	backdrop_path: string;
	// Массив идентификаторов жанров фильма.
	// Это свойство содержит массив целых чисел, представляющих идентификаторы жанров фильма.
	// Каждый идентификатор соответствует определенному жанру.
	// Например, [28, 12, 14, 878] может представлять жанры "Действие", "Приключения", "Фантастика", "Научная фантастика".
	genre_ids: number[];
	// Уникальный идентификатор фильма.
	// Это свойство содержит уникальный идентификатор фильма, который используется для однозначной
	// идентификации фильма в базе данных.
	// Например, идентификатор фильма может выглядеть так: 123456.
	id: number;
	// Исходный язык фильма.
	// Это свойство содержит код языка, на котором был снят фильм.
	// Например, код en означает, что фильм был снят на английском языке.
	original_language: string;
	// Исходное название фильма.
	// Это свойство содержит исходное название фильма в оригинальном языке.
	// Например, исходное название фильма "Avengers: Endgame" на английском языке - "Avengers: Endgame".
	original_title: string;
	// Краткое описание фильма.
	// Это свойство содержит краткое описание фильма.
	// Описание обычно используется для предоставления краткой информации о сюжете фильма.
	overview: string;
	// Популярность фильма, измеряемая в рейтинге.
	// Это свойство содержит числовое значение, представляющее популярность фильма.
	// Чем выше значение популярности, тем более популярным является фильм.
	// Значение популярности основано на различных факторах, таких как количество просмотров,
	popularity: number;
	// Путь к изображению постера фильма.
	// Это свойство содержит относительный путь к изображению постера фильма.
	// Путь можно использовать для загрузки изображения с сервера, на котором хранятся данные о фильмах.
	// Например, путь может выглядеть так: "/t/p/w500/some_movie_poster.jpg".
	poster_path: string;
	// Дата выхода фильма.
	// Это свойство содержит дату выхода фильма в формате YYYY-MM-DD.
	// Например, дата выхода фильма может выглядеть так: 2023-04-05.
	release_date: string;
	// Название фильма.
	// Это свойство содержит название фильма.
	// Название фильма может быть переведено на другой язык, если это необходимо.
	title: string;
	// Флаг, указывающий, является ли фильм видео.
	// Значение true означает, что фильм является видео, а false - что фильм не является видео.
	// Этот флаг используется для определения типа фильма.
	video: boolean;
	// Средняя оценка фильма.
	// Это свойство содержит среднюю оценку фильма, основанную на оценках пользователей.
	// Оценка обычно представлена в диапазоне от 0 до 10.
	vote_average: number;
	// Количество голосов за фильм.
	// Это свойство содержит количество голосов, которые были отданы за фильм пользователями.
	// Чем больше количество голосов, тем более надежной является оценка фильма.
	vote_count: number;
};
