using System.Text.Json.Serialization;

namespace flick_finder.Domain.Models;

// MovieModel: Глобальная модель фильмов. 
// Основной класс содержит поверхность данных
// Для получение подробностей используется Results
public class MovieModel
{
    // Свойство, представляющее номер текущей страницы результатов.
    // Это свойство используется для определения текущей страницы запроса, чтобы можно было получить 
    // информацию о фильмах с определенной страницы.
    [JsonPropertyName("page")]
    public int Page { get; set; }
    
    // Массив объектов ResultsMovie, представляющий список фильмов на текущей странице.
    // Это свойство содержит список фильмов, найденных по текущему запросу на указанной странице.
    // Каждый объект ResultsMovie содержит информацию о конкретном фильме.
    [JsonPropertyName("results")]
    public ResultsMovie[] Results { get; set; }
    
    // Свойство, представляющее общее количество страниц с результатами.
    // Это свойство указывает на общее количество страниц, доступных для текущего запроса.
    [JsonPropertyName("total_pages")]
    public int TotalPages { get; set; }
    
    // Свойство, представляющее общее количество найденных фильмов.
    // Это свойство указывает на общее количество фильмов, которые соответствуют текущему запросу.
    [JsonPropertyName("total_results")]
    public int TotalResults { get; set; }
}

// ResultsMovie модель самих фильмов 
public class ResultsMovie
{
    // Флаг, указывающий, является ли фильм для взрослых. 
    // Значение true означает, что фильм для взрослых, а false - что фильм не для взрослых.
    // Этот флаг используется для фильтрации результатов и предоставления родительского контроля.
    [JsonPropertyName("adult")]
    public bool Adult { get; set; }
    
    // Путь к изображению заднего плана фильма.
    // Это свойство содержит относительный путь к изображению заднего плана фильма.
    // Путь можно использовать для загрузки изображения с сервера, на котором хранятся данные о фильмах.
    [JsonPropertyName("backdrop_path")]
    public string BackdropPath { get; set; }
    
    // Массив идентификаторов жанров фильма.
    // Это свойство содержит массив целых чисел, представляющих идентификаторы жанров фильма.
    // Каждый идентификатор соответствует определенному жанру.
    // Например, [28, 12, 14, 878] может представлять жанры "Действие", "Приключения", "Фантастика", "Научная фантастика".
    [JsonPropertyName("genre_ids")]
    public int[] GenreIds { get; set; }
    
    // Уникальный идентификатор фильма.
    // Это свойство содержит уникальный идентификатор фильма, который используется для однозначной 
    // идентификации фильма в базе данных.
    // Например, идентификатор фильма может выглядеть так: 123456.
    [JsonPropertyName("id")]
    public int Id { get; set; }
    
    // Исходный язык фильма.
    // Это свойство содержит код языка, на котором был снят фильм.
    // Например, код en означает, что фильм был снят на английском языке.
    [JsonPropertyName("original_language")]
    public string OriginalLanguage { get; set; }
    
    // Исходное название фильма.
    // Это свойство содержит исходное название фильма в оригинальном языке.
    // Например, исходное название фильма "Avengers: Endgame" на английском языке - "Avengers: Endgame".
    [JsonPropertyName("original_title")]
    public string OriginalTitle { get; set; }
    
    // Краткое описание фильма.
    // Это свойство содержит краткое описание фильма.
    // Описание обычно используется для предоставления краткой информации о сюжете фильма.
    [JsonPropertyName("overview")]
    public string Overview { get; set; }
    
    // Популярность фильма, измеряемая в рейтинге.
    // Это свойство содержит числовое значение, представляющее популярность фильма.
    // Чем выше значение популярности, тем более популярным является фильм.
    // Значение популярности основано на различных факторах, таких как количество просмотров, 
    // оценок и обсуждений фильма.
    [JsonPropertyName("popularity")]
    public float Popularity { get; set; }
    
    // Путь к изображению постера фильма.
    // Это свойство содержит относительный путь к изображению постера фильма.
    // Путь можно использовать для загрузки изображения с сервера, на котором хранятся данные о фильмах.
    // Например, путь может выглядеть так: "/t/p/w500/some_movie_poster.jpg".
    [JsonPropertyName("poster_path")]
    public string PosterPath { get; set; }
    
    // Дата выхода фильма.
    // Это свойство содержит дату выхода фильма в формате YYYY-MM-DD.
    // Например, дата выхода фильма может выглядеть так: 2023-04-05.
    [JsonPropertyName("release_date")]
    public string ReleaseDate { get; set; }
    
    // Название фильма.
    // Это свойство содержит название фильма.
    // Название фильма может быть переведено на другой язык, если это необходимо.
    [JsonPropertyName("title")]
    public string Title { get; set; }
    
    // Флаг, указывающий, является ли фильм видео.
    // Значение true означает, что фильм является видео, а false - что фильм не является видео.
    // Этот флаг используется для определения типа фильма.
    [JsonPropertyName("video")]
    public bool Video { get; set; }
    
    // Средняя оценка фильма.
    // Это свойство содержит среднюю оценку фильма, основанную на оценках пользователей.
    // Оценка обычно представлена в диапазоне от 0 до 10.
    [JsonPropertyName("vote_average")]
    public float VoteAverage { get; set; }
    
    // Количество голосов за фильм.
    // Это свойство содержит количество голосов, которые были отданы за фильм пользователями.
    // Чем больше количество голосов, тем более надежной является оценка фильма.
    [JsonPropertyName("vote_count")]
    public int VoteCount { get; set; }
}